"""1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета
 заработной платы сотрудника. В расчете необходимо использовать
 формулу: (выработка в часах * ставка в час) + премия. Для выполнения расчета
 для конкретных значений необходимо запускать скрипт с параметрами."""

# импорт функции zp описаной в файле Step_4_funk
from Step_4_funk import zp

print("размер заработной платы составляет", zp())


